<!DOCTYPE html>
<html>
<head>
<meta charset="utf-8" />
<title>TextWarrior Hilfe</title>
<link rel="stylesheet" href="help.css" type="text/css" media="all" />
</head>
<body>

<h2>INHALT</h2>
<div class="subsection">
	<ul>
	<li><a href="#navigation">Cursor Steuerung</a>
	<li><a href="#selection">Text Selektion</a>
	<li><a href="#clipboard">Zwischenablage</a>
	<li><a href="#find">Suchen / Ersetzen</a>
	<li><a href="#keyboard">Hardware Tastatur Anleitung</a>
	<li><a href="#backup">Backup und Datenwiederherstellung</a>
	<li><a href="#settings">Optionen</a>
	<li><a href="#roadmap">Angaben zu den Versionen</a>
	<li><a href="#issues">Bekannte Probleme</a>
	</ul>
</div>


<h2><a id = "navigation">CURSOR STEUERUNG</a></h2>
<div class="subsection">
	<p>Textbearbeitung mit einem Touch Screen einfacher zu machen ist immer priorit&auml;r f&uuml;r TextWarrior.
	Deshalb gibt es f&uuml;nf Methoden den Cursor zu positionieren, je nach Ihrem bevorzugten Arbeitsstil.</p>
	<p>Diese sind w&auml;hlbar unter <em>Optionen → Cursorsteuerung</em>.</p>
</div>

<div class="subsection">
	<h3>Einfach</h3>
	<p>Tippen Sie irgendwo in den Text.</p>
	<p>Sie k&ouml;nnen auch den Cursor ber&uuml;hren und an die gew&uuml;nschte Position ziehen.
	Dies funktioniert nur, wenn <em>Optionen → Ziehung macht Selektion</em> nicht gew&auml;hlt ist.</p>
	<p>Die einfache Methode ist immer aktiv, auch wenn andere Steuerungsmethoden gew&auml;hlt sind.</p>
</div>

<div class="subsection">
	<h3>Tastfeld</h3>
	<p>Tippen Sie auf die Schaltfl&auml;che <span><img src="images/trackpad_open.png" alt="Minimize icon"><span>
	 unten rechts auf den Bildschirm, um das Tastfeld einzublenden.</p>
	<p>Um den Cursor zu bewegen, fahren Sie in die gew&uuml;nschte Richtung auf dem Tastfeld.</p>
	<p>Tippen Sie irgendwo auf das Tastfeld, um es wieder auszublenden.</p>
</div>

<div class="subsection">
	<h3>Jo-jo</h3>
	<p>Dr&uuml;cken und halten Sie auf das runde Jo-jo, welches unter dem Cursor h&auml;ngt, und ziehen Sie es in die gew&uuml;nschte Richtung.</p>
</div>

<div class="subsection">
	<h3>Fl&uuml;ssigkeit</h3>
	<em>Nur verf&uuml;gbar auf Ger&auml;ten mit Beschleunigungsmesser.</em>
	<p>Dr&uuml;cken und halten Sie den Feuerknopf unten rechts auf dem Bildschirm, um den Fl&uuml;ssigkeit-Modus zu aktivieren.</p>
	<p>Im Fl&uuml;ssigkeit-Modus kann der Cursor durch Kippen des Ger&auml;tes in die gew&uuml;nschte Richtung bewegt werden.</p>
	<ul>
	<li>Aufw&auml;rts: Bildschirm ist waagrecht
	<li>Abw&auml;rts: Bildschirm ist vertikal und gegen Sie gerichtet. Die untere Kante des Bildschirms zeigt gegen den Boden.
	<li>Links: Bildschirm ist nach links gekippt.
	<li>Rechts: Bildschirm ist nach rechts gekippt.
	<li>Rest (keine Bewegung): Der Bildschirm ist gegen Sie gerichtet und zeigt im 45 Grad Winkel gegen den Boden.
	</ul>
	<p>Wenn der Feuerknopf losgelassen wird, stoppt die Cursor Bewegung und der Fl&uuml;ssigkeit-Modus ist wieder inaktiv.</p>
	<p>Am besten funktioniert diese Steuerungsmethode, wenn der automatische Wechsel zwischen Hoch- und Queransicht auf Ihrem Ger&auml;t
	deaktiviert ist. Vermeiden Sie auch, den Cursor gleichzeitig in zwei Richtungen zu bewegen.</p>
	<p><strong>Achtung:</strong> Dieser Modus verbraucht viel Energie. Behalten Sie die Batterieanzeige im Auge!</p>
</div>

<div class="subsection">
	<h3>Lautst&auml;rketasten</h3>
	<p>Dr&uuml;cken Sie die Lautst&auml;rketasten nach oben/unten, um den Cursor nach rechts/links zu bewegen.</p>
	<p>In diesem Modus steuern die Tasten nicht mehr die Lautst&auml;rke des Ger&auml;ts. Die Tasten funktionieren
	aber wieder normal, wenn Sie zu einer anderen Anwendung wechseln.</p>
</div>


<h2><a id = "selection">TEXT SELEKTION</a></h2>
<div class="subsection">
	<h3>Text selektieren</h3>
	<p>Doppel-Tippen Sie irgendwo auf den Text, um in den Selektionsmodus zu wechseln.</p>
	<p>Alternativ hierzu, falls <em>Optionen → Ziehung macht Selektion</em> aktiviert ist, k&ouml;nnen Sie einfach den Cursor ber&uuml;hren und ziehen.</p>
	<p>Mit einer Hardware Tastatur k&ouml;nnen Sie die Umschalttaste (Shift) dr&uuml;cken und mit den Cursortasten fahren.</p>
	<p>Im Selektionsmodus wird der Cursor als k&uuml;rzeres Rechteck angezeigt.</p>
	<p><strong>Tip:</strong> Nach dem Doppel-Tippen k&ouml;nnen Sie den Finger gleich auf dem Bildschirm lassen und anfangen, den Text zu selektieren.</p>
</div>

<div class="subsection">
	<h3>Selektion &auml;ndern</h3>
	<p>Dr&uuml;cken und halten Sie ein Ende der Selektion und ziehen Sie es in die gew&uuml;nschte Position.</p>
	<p>Die oben beschriebenen Cursor Steuerungsmethoden k&ouml;nnen ebenfalls benutzt werden. Tippen Sie den Anfang oder das Ende der Selektion an, um den Cursor dort zu positionieren und den Start der aktuellen Cursorbewegung zu setzen.</p>
	<p>Mit einer Hardware Tastatur k&ouml;nnen Sie auch die Umschalttaste (Shift) dr&uuml;cken und mit den Cursortasten fahren.</p>
</div>

<div class="subsection">
	<h3>Selektion aufheben</h3>
	<p>Um den Selektionsmodus zu verlassen tippen Sie irgendwo in einen nicht selektierten Textbereich.</p>
	<p>Sie k&ouml;nnen auch den selektierten Text Doppel-Tippen.</p>
	<p>Mit einer Hardware Tastatur k&ouml;nnen Sie auch irgendeine Cursortaste dr&uuml;cken.</p>
</div>

<div class="subsection">
	<h3>Selektionsangaben</h3>
	<p>Die Option <em>Wortz&auml;hlung und Eigenschaften</em> im Hauptmen&uuml; zeigt Angaben zur Selektion wie Anzahl W&ouml;rter und Anzahl Zeichen.
	Ohne Selektion zeigt der Men&uuml;punkt die Angaben f&uuml;r die ganze Datei.</p>
</div>


<h2><a id = "clipboard">ZWISCHENABLAGE</a></h2>
<div class="subsection">
	<p>Die Pfeil-Schaltfl&auml;che oben rechts &ouml;ffnet die Zwischenablage.</p>
	<p>Tippen Sie die Schaltfl&auml;che oder ziehen Sie sie nach unten, um die Zwischenablage anzuzeigen.</p>
	<p>Tippen Sie die Schaltfl&auml;che oder ziehen Sie sie nach oben, um die Zwischenablage zu schliessen. 
	Die Zwischenablage kann auch geschlossen werden, indem man sie nach oben wischt.</p>
</div>


<h2><a id = "find">SUCHEN / ERSETZEN</a></h2>
<div class="subsection">
	<h3>Suchen und Ersetzen Balken anzeigen</h3>
	<p>Der 'Suchen' Balken kann mit dem 'Suche/Ersetze' Men&uuml; ein- und ausgeblendet werden.</p>
	<p>Sie k&ouml;nnen auch den 'Such' Knopf dr&uuml;cken, wenn das Ger&auml;t einen solchen hat.</p>
	<p>Der 'Ersetzen' Balken ist normalerweise ausgeblendet. 
	Um ihn anzuzeigen, tippen Sie auf <span><img src="images/arrow_down.png" alt="Double arrows down"><span>
	an der linken Seite des Suchbalkens. Tippen Sie nochmal, um den 'Ersetzen' Balken wieder auszublenden.</p>
</div>

<div class="subsection">
	<h3>Schaltfl&auml;chen</h3>
	<p><span><img src="images/find_forwards.png"><span> Suche vorw&auml;rts</p>
	<p><span><img src="images/find_backwards.png"><span> Suche r&uuml;ckw&auml;rts</p>
	<p><span><img src="images/replace.png"><span> Markierten Text ersetzen</p>
	<p><span><img src="images/replace_all.png"><span> Alles ersetzen</p>
	<p><span><img src="images/settings.png"><span> Suchoptionen</p>
</div>


<h2><a id = "keyboard">HARDWARE TASTATUR ANLEITUNG</a></h2>
<div class="subsection">
	Folgende Tastenkombinationen gelten f&uuml;r die meisten Hardware Tastaturen:
	<p>Shift + Enter: Umschalten zwischen 'Suchen / Ersetzen' Balken und Haupt Textfeld</p>
	<p>Shift + Space: Tabulator einf&uuml;gen</p>
	<p>Langes Dr&uuml;cken einer Buchstaben-Taste: Erzeugt einen Großbuchstaben, falls
		<em>Optionen → Großschr. bei langem Dr&uuml;ck</em> aktiviert ist.</p>
</div>


<h2><a id = "backup">BACKUP UND DATENWIEDERHERSTELLUNG</a></h2>
<div class="subsection">
<h3>Auto-Backup</h3>
<p>Diese Funktion bieten die Datenwiederherstellung von ungesicherten 
	&Auml;nderungen. Es wird <strong>dringend empfohlen</strong> Auto-Backup
	aktiv lassen.
</p>
<p>Auto-Backup funktioniert nur dann, wenn der Speicherplatz ausreichend 
	f&uuml;r das Backup der Datei ist.
</p>
</div>

<div class="subsection">
<h3>Wie kann man ungesicherten &Auml;nderungen wiederherstellt?</h3>
<p>Falls Auto-Backup nicht activiert w&auml;hrend des Datenverlust, kann die Daten
	leider nicht hergestellt wird.<br>
	Wenn Auto-Backup activiert ist, schauen Sie die folgenden Verzeichnisse an:
</p>
<h4>Interner Speicher (nur mit &quot;rooted&quot; Ger&auml;te)</h4>
<p class="code">
	/data/data/Android/data/com.myopicmobile.textwarrior.android/files
</p>
<h4>Externer Speicher</h4>
<p class="code">
	&lt;externer Speicher&gt;/Android/data/com.myopicmobile.textwarrior.android/files
</p>
<p>(<span class="code">&lt;externer Speicher&gt;</span> ist normalerweise <span class="code">/sdcard</span>)
</p>
</div>

<div class="subsection">
<h3>Backup H&auml;ufigkeit</h3>
<p>Wenn "Auto-Backup" aktiviert ist, wird in folgenden Situationen ein Backup der 
	ungesicherten &Auml;nderungen gemacht:
	<ol>
	<li>Wechsel zu einer anderen Anwendung
	<li>Wechsel zur TextWarrior 'Optionen' Seite
	<li>Wechsel zum TextWarrior Dateibrowser zum &Ouml;ffnen/Speichern einer Datei
	<li>Wenn TextWarrior durch Android beendet wird
	</ol>
	Bei großen Dateien kann das Auto-Backup eine Weile dauern und TextWarrior
	k&ouml;nnte in obigen Situationen tr&auml;ge wirken. Bitte haben Sie Geduld, es wird wieder
	alles normal funktionieren, wenn das Backup beendet ist.
<p>Wenn Sie in obigen Situationen eine schnellere Verarbeitung wollen, oder wenn Sie
	regelm&auml;ssig mit großen Dateien arbeiten, oder wenn Sie Batterie/Speicherkartenplatz
	sparen wollen, dann deaktivieren Sie vielleicht besser das Auto-Backup.
	Dann gehen aber ungesicherte &Auml;nderungen verloren, wenn Android TextWarrior
	beendet, um mehr Arbeitsspeicher zu bekommen. Dies kann dann geschehen, wenn
	zuviele Anwendungen gleichzeitig öffnen sind und TextWarrior nicht die aktive 
	Anwendung ist.
</p>
</div>


<h2><a id = "settings">OPTIONEN</a></h2>
<div class="subsection">
<h3>Eingabe- und Ausgabekodierung, Zeilenende</h3>
<p>Wenn Sie die Optionen dieser Kategorie nicht verstehen, w&auml;hlen Sie am besten "Auto".</p>
</div>


<h2><a id = "roadmap">ANGABEN ZU DEN VERSIONEN</a></h2>
<div class="subsection">
	<h3>v0.93</h3>
	<ul>
	<li>Neue Farbschemas
	<li>Stabileres Auto-Backup
	</ul>
</div>

<div class="subsection">
	<h3>v0.92</h3>
	<ul>
	<li>Bugfix: Software Tastatur im Zahlenmodus wechselt unbeabsichtigt in den
	Buchstabenmodus, wenn eine Taste angetippt wird.
	</ul>
</div>

<div class="subsection">
	<h3>v0.91</h3>
	<ul>
	<li>Auto-Backup
	<li>Fortschrittsanzeige zeigt die aktuelle Operation an, anstatt nur eine 
	generische "Bitte warten" Meldung
	<li>R&uuml;ckmeldung, wenn eine Ersetzen-Operation fehlschl&auml;gt
	</ul>
</div>

<h2><a id = "issues">BEKANNTE PROBLEME</a></h2>
<div class="subsection">
	<ul>
	<li>Der Zeilenumbruch ist nicht optimiert. Bei sehr großen Dateien
			(32000+ Zeilen oder >1MB) k&ouml;nnte es sp&uuml;rbare Verz&ouml;gerungen geben und die Fortschrittsbalken
			k&ouml;nnten nicht den tats&auml;chlichen Fortschritt anzeigen.
			F&uuml;r bessere Leistung bei riesigen Dateien ist das Arbeiten ohne Zeilenumbruch wom&ouml;glich die 
			bessere Wahl.
	<li>Im Querformat kann die virtuelle Tastatur den Cursor &uuml;berdecken.
	<li>Im Querformat sind die Vorschl&auml;ge der virtuellen Tastatur nicht sichtbar
	<li>Das Lang-Dr&uuml;cken funktioniert bei gewissen Motorola Hardware Tastaturen nicht
	<li>Wenn w&auml;hrend der Textbearbeitung der Arbeitsspeicher ausgeht, st&uuml;rzt TextWarrior ab, ohne den Text zu speichern
	<li>Die Ausschneiden/Kopieren/Einf&uuml;gen Schaltfl&auml;chen funktionieren nur im Haupttext, nicht aber in den Suchen/Ersetzen Feldern
	<li>C#: Verbatim Strings sind nicht unterst&uuml;tzt
	<li>PHP: nur klein geschriebene Schl&uuml;sselw&ouml;rter sind unterst&uuml;tzt. Parameter, welche per Referenz
	&uuml;bergeben werden, sind nicht eingef&auml;rbt. Heredoc und Nowdoc sind nicht unterst&uuml;tzt.
	<li>Syntax Highlighting braucht viel Zeit bei sehr großen Dateien.
	<li>Dateien, welche einen Mix von Zeilenende Stilen enthalten, werden unter Umst&auml;nden nicht korrekt ge&ouml;ffnet.
	</ul>
</div>

</body>
</html>